todos/2024/2024-10/2024-10-30.org
#+OPTIONS: ^:{} H:0 num:0

* 2024-10-30
** Utopia
- [ ] integrant prep 과 prep-key deprecated 되었음
- [ ] fx-cofx 자동 예시 따오기
- [ ] malli schema 만들기
- [ ] web socket setting
- [ ] auth
- [ ] 이제까지의 모든것들 중 매크로화 할 수 있는 것들 전부 매크로화하기
** 개인 공부
*** Computer Networking
**** 7. 무선 이동 네트워크
*** Docker
**** 1. 도커 컨테이너와 이미지 이해하기
- [X] 4. 애플리케이션 소스 코드에서 도커 이미지까지
- [ ] 5. 도커 허브 등 레지스트리에 이미지 공유하기
- [ ] 6. 도커 볼륨을 이용한 퍼시스턴트 스토리지
*** Jenkins
*** Kubernetes
*** 데이터베이스 시스템
*** Elk Stack
*** Prometheus Grafana
*** Kafka
*** Hadoop
*** Hive
*** Scala
*** Spark
*** 데이터 중심 애플리케이션 설계
*** gRPC
*** nginX
*** Category Theory For Programmers
*** Structure and Interpretation of Computer Programs
*** The Joy of Clojure
*** Clojure 최적화
*** MongoDB
*** Redis
*** C++ 기초 플러스
*** CUDA C Programming
*** 밑바닥부터 시작하는 딥러닝
*** 밑바닥부터 시작하는 딥러닝 2
*** 밑바닥부터 시작하는 딥러닝 3
*** 핸즈온 머신러닝
*** Scala 머신러닝
*** SQL (고급사용 및 최적화)
*** Java 최적화
