todos/2024/2024-10/2024-10-30.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-01 Fri 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kwonryul" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="file:///home/kwonryul/.emacs.d/css/org.css" />
</head>
<body>
<div id="content" class="content">

<ul class="org-ul">
<li><a id="org5a58ba4"></a>2024-10-30<br />
<ul class="org-ul">
<li><a id="org0afb12a"></a>Utopia<br />
<div class="outline-text-3" id="text-org0afb12a">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> integrant prep 과 prep-key deprecated 되었음</li>
<li class="off"><code>[&#xa0;]</code> fx-cofx 자동 예시 따오기</li>
<li class="off"><code>[&#xa0;]</code> malli schema 만들기</li>
<li class="off"><code>[&#xa0;]</code> web socket setting</li>
<li class="off"><code>[&#xa0;]</code> auth</li>
<li class="off"><code>[&#xa0;]</code> 이제까지의 모든것들 중 매크로화 할 수 있는 것들 전부 매크로화하기</li>
</ul>
</div>
</li>
<li><a id="org4b0f160"></a>개인 공부<br />
<ul class="org-ul">
<li><a id="orgb6efeb3"></a>Computer Networking<br />
<ul class="org-ul">
<li><a id="orgf2d1b1a"></a>7. 무선 이동 네트워크<br /></li>
</ul>
</li>
<li><a id="org09c5f9b"></a>Docker<br />
<ul class="org-ul">
<li><a id="org21762a4"></a>1. 도커 컨테이너와 이미지 이해하기<br />
<div class="outline-text-5" id="text-org21762a4">
<ul class="org-ul">
<li class="on"><code>[X]</code> 4. 애플리케이션 소스 코드에서 도커 이미지까지</li>
<li class="off"><code>[&#xa0;]</code> 5. 도커 허브 등 레지스트리에 이미지 공유하기</li>
<li class="off"><code>[&#xa0;]</code> 6. 도커 볼륨을 이용한 퍼시스턴트 스토리지</li>
</ul>
</div>
</li>
</ul>
</li>
<li><a id="org8854daa"></a>Jenkins<br /></li>
<li><a id="org03adcaa"></a>Kubernetes<br /></li>
<li><a id="org20cf498"></a>데이터베이스 시스템<br /></li>
<li><a id="orgacbf7c9"></a>Elk Stack<br /></li>
<li><a id="orgace9151"></a>Prometheus Grafana<br /></li>
<li><a id="orgba04250"></a>Kafka<br /></li>
<li><a id="org62e3518"></a>Hadoop<br /></li>
<li><a id="org2c89c57"></a>Hive<br /></li>
<li><a id="org8d8c0fa"></a>Scala<br /></li>
<li><a id="org56a0b4c"></a>Spark<br /></li>
<li><a id="orgff8b9df"></a>데이터 중심 애플리케이션 설계<br /></li>
<li><a id="org1910037"></a>gRPC<br /></li>
<li><a id="orgb7fce4e"></a>nginX<br /></li>
<li><a id="orge072461"></a>Category Theory For Programmers<br /></li>
<li><a id="org0a4bf66"></a>Structure and Interpretation of Computer Programs<br /></li>
<li><a id="org63ffbbb"></a>The Joy of Clojure<br /></li>
<li><a id="org97e67b9"></a>Clojure 최적화<br /></li>
<li><a id="org717e169"></a>MongoDB<br /></li>
<li><a id="org0006cd7"></a>Redis<br /></li>
<li><a id="org2f64319"></a>C++ 기초 플러스<br /></li>
<li><a id="orgd681333"></a>CUDA C Programming<br /></li>
<li><a id="orga5c4469"></a>밑바닥부터 시작하는 딥러닝<br /></li>
<li><a id="orgbe29b88"></a>밑바닥부터 시작하는 딥러닝 2<br /></li>
<li><a id="orgda37a52"></a>밑바닥부터 시작하는 딥러닝 3<br /></li>
<li><a id="org891ae04"></a>핸즈온 머신러닝<br /></li>
<li><a id="org66fcf1e"></a>Scala 머신러닝<br /></li>
<li><a id="org39e1f6c"></a>SQL (고급사용 및 최적화)<br /></li>
<li><a id="org7eb069d"></a>Java 최적화<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: kwonryul</p>
<p class="date">Created: 2024-11-01 Fri 15:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
